src/Catalogs/Тарифы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Тарифы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРасчета</Name>
					<Comment>0-строго по сетке, 1-по цене на начало , 2-фиксированная цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРасшифровки</Name>
					<Comment>0-без расшифровки, 1-общий период, 2-подробно</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПодготовки</Name>
					<Comment>в течение которого можно отказаться без оплаты</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяЦены</Name>
					<Comment>за что указывается цена</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дискретность</Name>
					<Comment>тарифицируемого времени</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросВремени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинВремя</Name>
					<Comment>на которое можно оформить заказ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьДаты</Name>
					<Comment>для интервалов времени</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>если фиксированная</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоОкругления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Comment>для обновления тарифных сеток в РМ</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТарифнаяСетка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипДня</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыДней</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Тарифы/Forms/ФормаЭлемента/module.bsl
Перем ТаблицаИменКолонокТарифнойСетки;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	УправлениеРИБ.ПередОткрытиемЭлементаСправочника(ЭтотОбъект, ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	Если ЭтоНовый() И НЕ ЗначениеЗаполнено(ПараметрОбъектКопирования) Тогда
		Валюта = Константы.ОсновнаяВалюта.Получить();
		ПравилоОкругления = Константы.ОсновноеПравилоОкругления.Получить();
	КонецЕсли;
	
	ФормаТарифнаяСетка = Защита.ЗаполнитьТарифнуюСетку( ?(ЗначениеЗаполнено(ПараметрОбъектКопирования), ПараметрОбъектКопирования, Ссылка), ТаблицаИменКолонокТарифнойСетки);
	
	Колонки = ЭлементыФормы.ТарифнаяСетка.Колонки;
	Колонки.Время.Данные = "Время";
	
	Для каждого СтрокаИмен Из ТаблицаИменКолонокТарифнойСетки Цикл
		КолонкаЦена = Колонки.Добавить(СтрокаИмен.Цена, СтрокаИмен.ТипДня.Наименование);
		КолонкаЦена.Данные = СтрокаИмен.Цена;
		КолонкаЦена.ЭлементУправления.КнопкаСпискаВыбора = Истина;
		КолонкаЦена.ЭлементУправления.УстановитьДействие("ОбработкаВыбора", Новый Действие("ТарифнаяСеткаЦенаОбработкаВыбора"));
		СписокДействий = КолонкаЦена.ЭлементУправления.СписокВыбора;
		СписокДействий.Добавить("Очистить");
		СписокДействий.Добавить("Бесплатно");
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновлениеОтображения()
	
	ЭлементыФормы.ПанельЗакладки.Страницы.ТарифнаяСетка.Видимость = (ВариантРасчета < 2);
	
	ЭлементыФормы.НадписьВремяПодготовки.Видимость = НЕ ЗапросВремени;
	ЭлементыФормы.ВремяПодготовки.Видимость = НЕ ЗапросВремени;
	
	ЭлементыФормы.НадписьЦена.Доступность = (ВариантРасчета = 2);
	ЭлементыФормы.Цена.Доступность = (ВариантРасчета = 2);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЗапросВремени Тогда
		ВремяПодготовки = Неопределено;
	КонецЕсли;
	
	ТарифнаяСетка.Очистить();
	
	Для каждого СтрокаИмен Из ТаблицаИменКолонокТарифнойСетки Цикл
		Для Каждого СтрокаСетки Из ФормаТарифнаяСетка Цикл
			
			Если СтрокаСетки[СтрокаИмен.Цена]<>0 ИЛИ СтрокаСетки[СтрокаИмен.Бесплатно] Тогда
				НоваяСтрока = ТарифнаяСетка.Добавить();
				НоваяСтрока.ТипДня	= СтрокаИмен.ТипДня;
				НоваяСтрока.Время	= СтрокаСетки.Время;
				НоваяСтрока.Цена	= СтрокаСетки[СтрокаИмен.Цена];
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ТарифнаяСеткаПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Для каждого СтрокаИмен Из ТаблицаИменКолонокТарифнойСетки Цикл
		Если ДанныеСтроки[СтрокаИмен.Бесплатно] И ДанныеСтроки[СтрокаИмен.Цена]=0 Тогда
			ОформлениеСтроки.Ячейки[СтрокаИмен.Цена].Текст = "Бесплатно";
		КонецЕсли; 
	КонецЦикла;
	
	//ОформлениеСтроки.Ячейки.Время.УстановитьТекст(Формат(ДанныеСтроки.Время,"ДФ=ЧЧ:мм;ДП=00:00"));
	
КонецПроцедуры

Процедура ТарифнаяСеткаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	// проверка существования строки с таким же временем
	Если НЕ ОтменаРедактирования Тогда
		МассивСтрок = ФормаТарифнаяСетка.НайтиСтроки(Новый Структура("Время",Элемент.ТекущиеДанные.Время));
		Если МассивСтрок.Количество() > 1 Тогда
			Предупреждение("Такое время уже есть!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ТарифнаяСеткаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НЕ ОтменаРедактирования Тогда
		ФормаТарифнаяСетка.Сортировать("Время");
	КонецЕсли;
	
КонецПроцедуры

Процедура ТарифнаяСеткаВремяНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИнтерфейсАдмина.ВыбратьВремяИзСписка(ЭтаФорма, Элемент);
	
КонецПроцедуры

Процедура ТарифнаяСеткаЦенаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИмяБесплатно = СтрЗаменить(ЭлементыФормы.ТарифнаяСетка.ТекущаяКолонка.Имя, "Цена", "Бесплатно");
	
	Если ВыбранноеЗначение = "Очистить" Тогда
		Элемент.Значение = 0;
		ЭлементыФормы.ТарифнаяСетка.ТекущиеДанные[ИмяБесплатно] = Ложь;
		
	ИначеЕсли ВыбранноеЗначение = "Бесплатно" Тогда
		Элемент.Значение = 0;
		ЭлементыФормы.ТарифнаяСетка.ТекущиеДанные[ИмяБесплатно] = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
